name = "BMW E34 არის BMW 5 სერიის მესამე თაობა, რომელიც იწარმოებოდა 1987 წლის 2 ნოემბრიდან 1996 წლამდე. "
name1 = "თავდაპირველად გამოშვებული იყო როგორც სალონი 1988 წლის იანვარში, E34-მა ასევე დაინახა 1992 წლის სექტემბერში დამატებული ძარის Touring"
name2 = "ვაგონის (ესტას) ძარის სტილი, პირველი მე-5 სერიის. BMW-მ E34 შეცვალა E39 5 სერიის 1995 წლის დეკემბერში, თუმცა E34 Touring "
name3 = "მოდელები წარმოებაში დარჩა 1996 წლის ივნისამდე."
allnames = name + ' ' + name1 + ' ' + name2 + '' + name3
print(allnames)